---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.Insert(Autodesk.Revit.DB.IntersectionResult,System.Int32)
source: html/d5eb5729-98ed-35ec-1f47-ca19402cf7d3.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	IntersectionResult item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.IntersectionResult`)
- **index** (`System.Int32`)